// -------------------------------------------------------------------------------
// 
// 		ＤＸライブラリ		iOS用標準関数の互換関数プログラムヘッダファイル
// 
// 				Ver 3.25a
// 
// -------------------------------------------------------------------------------

#ifndef DX_BASEFUNC_IOS_H
#define DX_BASEFUNC_IOS_H

// インクルード ------------------------------------------------------------------
#include "../DxCompileConfig.h"
#include "../DxBaseFunc.h"

#ifndef DX_NON_NAMESPACE

namespace DxLib
{

#endif // DX_NON_NAMESPACE

// マクロ定義 --------------------------------------------------------------------

#define IOS_WCHAR_CHARCODEFORMAT		(DX_CHARCODEFORMAT_UTF32LE)

// 構造体定義 --------------------------------------------------------------------

// テーブル-----------------------------------------------------------------------

// 内部大域変数宣言 --------------------------------------------------------------

// 関数プロトタイプ宣言-----------------------------------------------------------


#ifndef DX_NON_NAMESPACE

}

#endif // DX_NON_NAMESPACE

#endif // DX_BASEFUNC_IOS_H
