// -------------------------------------------------------------------------------
// 
// 		ＤＸライブラリ		Windows用システムプログラムヘッダファイル
// 
// 				Ver 3.25a
// 
// -------------------------------------------------------------------------------

#ifndef DX_SYSTEMWIN_H
#define DX_SYSTEMWIN_H

// インクルード ------------------------------------------------------------------
#include "../DxCompileConfig.h"
#include "DxWindow.h"

#ifndef DX_NON_NAMESPACE

namespace DxLib
{

#endif // DX_NON_NAMESPACE

// マクロ定義 --------------------------------------------------------------------

// ソフトがアクティブかどうかをチェックする
#define CheckActiveState()															\
	if( WinData.ActiveFlag == FALSE && WinData.WM_ACTIVATE_ProcessFlag == FALSE )	\
		DxActiveWait() ;

// 構造体定義 --------------------------------------------------------------------

// テーブル-----------------------------------------------------------------------

// 内部大域変数宣言 --------------------------------------------------------------

// 関数プロトタイプ宣言-----------------------------------------------------------

#ifndef DX_NON_NAMESPACE

}

#endif // DX_NON_NAMESPACE

#endif // DX_SYSTEMWIN_H
